---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfTreads
source: html/e776b550-a28c-b54d-8aee-2470c807cf38.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfTreads Method

Gets the number of treads.

## Syntax (C#)
```csharp
public IList<int> GetNumberOfTreads()
```

## Returns
The list of numbers of treads.